>> 개발10 
* scanf(서식 문자열, 변수의 주소) 함수: 키보드로 데이터 입력 받기 
* 모드함수 
MOD(i, 2) = 0 

*int 함수 이용
INT(i/2) = i/2

* 몫, 나머지 이용 

* 알고리즘 조건 
1) 입력
2) 출력
3) 명확성
4) 유한성 
5) 효과성 

* 알고리즘 기법 
1) 분할 정복법 (문제 단위로 나눈 다음 다시 합침)
2) 동적 계획법 (다른 범위까지의 값을 이용 <-- 피보나치 수열) 
3) 그리디 알고리즘 : 당장 최적인 답을 선택하여 적합한 결과를 도출 <-- 종합적으로 최적이라는 보장은 없음 
4) 백트래킹 : "트리" 탐색 알고리즘 

* 알고리즘 효율성 평가 
1) 시간 복잡도 : 프로그램을 실행시켜 완료하는데 걸리는 시간 
 1)) O(n)의 시간 복잡도 (순차 탐색) 
 2)) O(n^2) : 제곱형 복잡도 (선택정렬, 버블정렬, 삽입정렬) 
 3)) O(1) : 상수형 복잡도 (해시 함수) 
 4)) O)(log_2n...